TexasInstruments/c2000ware-core-sdk/device_support/f2838x/common/source/f2838x_swprioritizedpievect.c
    #if (G2_15PL != 0)
    EPWM15_TZ_ISR,                              // 2.15 - ePWM15 Trip Zone Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G2_16PL != 0)
    EPWM16_TZ_ISR,                              // 2.16 - ePWM16 Trip Zone Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_9PL != 0)
    EPWM9_ISR,                    // 3.9 - ePWM9 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_10PL != 0)
    EPWM10_ISR,                   // 3.10 - ePWM10 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_11PL != 0)
    EPWM11_ISR,                   // 3.11 - ePWM11 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_12PL != 0)
    EPWM12_ISR,                   // 3.12 - ePWM12 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_13PL != 0)
    EPWM13_ISR,                                 // 3.13 - ePWM13 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_14PL != 0)
    EPWM14_ISR,                                 // 3.14 - ePWM14 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_15PL != 0)
    EPWM15_ISR,                                 // 3.15 - ePWM15 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G3_16PL != 0)
    EPWM16_ISR,                                 // 3.16 - ePWM16 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_9PL != 0)
    FSITXA_INT1_ISR,                            // 4.9 - FSIA Transmit interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_10PL != 0)
    FSITXA_INT2_ISR,                            // 4.10 - FSIA Transmit interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_11PL != 0)
    FSITXB_INT1_ISR,                            // 4.11 - FSIB Transmit interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_12PL != 0)
    FSITXB_INT2_ISR,                            // 4.12 - FSIB Transmit interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_13PL != 0)
    FSIRXA_INT1_ISR,                            // 4.13 - FSIA Receive interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_14PL != 0)
    FSIRXA_INT2_ISR,                            // 4.14 - FSIA Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_15PL != 0)
    FSIRXB_INT1_ISR,                            // 4.15 - FSIB Receive interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G4_16PL != 0)
    FSIRXB_INT2_ISR,                            // 4.16 - FSIB Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_9PL != 0)
    SD1_ISR,                      // 5.9 - SD1 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_10PL != 0)
    SD2_ISR,                      // 5.10 - SD2 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_11PL != 0)
    ECATRSTINTN_ISR,                            // 5.11 - ETHERCAT Resetout Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_12PL != 0)
    ECATSYNC1_ISR,                              // 5.12 - ETHERCAT SYNC1 interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_13PL != 0)
    SDFM1DR1_ISR,                               // 5.13 - Sigma Delta Filter Module1  Filter 1 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_14PL != 0)
    SDFM1DR2_ISR,                               // 5.14 - Sigma Delta Filter Module1  Filter 2 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_15PL != 0)
    SDFM1DR3_ISR,                               // 5.15 - Sigma Delta Filter Module1  Filter 3 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G5_16PL != 0)
    SDFM1DR4_ISR,                               // 5.16 - Sigma Delta Filter Module1  Filter 4 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_9PL != 0)
    SPIC_RX_ISR,                  // 6.9 - SPIC Receive Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_10PL != 0)
    SPIC_TX_ISR,                  // 6.10 - SPIC Transmit Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif
    #if (G6_11PL != 0)
    SPID_RX_ISR,                                // 6.11 - SPID Receive Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_12PL != 0)
    SPID_TX_ISR,                                // 6.12 - SPID Transmit Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_13PL != 0)
    SDFM2DR1_ISR,                               // 6.13 - Sigma Delta Filter Module2  Filter 1 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_14PL != 0)
    SDFM2DR2_ISR,                               // 6.14 - Sigma Delta Filter Module2  Filter 2 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_15PL != 0)
    SDFM2DR3_ISR,                               // 6.15 - Sigma Delta Filter Module2  Filter 3 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G6_16PL != 0)
    SDFM2DR4_ISR,                               // 6.16 - Sigma Delta Filter Module2  Filter 4 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif
    #if (G4_13PL != 0)
    FSIRXC_INT1_ISR,                            // 7.9 - FSIC Receive Interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G7_10PL != 0)
    FSIRXC_INT2_ISR,                            // 7.10 - FSIC Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G7_11PL != 0)
    FSIRXD_INT1_ISR,                            // 7.11 - FSID Receive interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G7_12PL != 0)
    FSIRXD_INT2_ISR,                            // 7.12 - FSID Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif
    #if (G7_13PL != 0)
    FSIRXE_INT1_ISR,                            // 7.13 - FSIE Receive interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G7_14PL != 0)
    FSIRXE_INT2_ISR,                            // 7.14 - FSIE Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G7_15PL != 0)
    FSIRXF_INT1_ISR,                            // 7.15 - FSIF Receive Interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G7_16PL != 0)
    FSIRXF_INT2_ISR,                            // 7.16 - FSIF Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_9PL != 0)
    FSIRXG_INT1_ISR,                            // 8.9 - FSIG Receive interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_10PL != 0)
    FSIRXG_INT2_ISR,                            // 8.10 - FSIG Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_11PL != 0)
    FSIRXH_INT1_ISR,                            // 8.11 - FSIH Receive interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

