TexasInstruments/c2000ware-core-sdk/device_support/f2838x/common/source/f2838x_swprioritizedpievect.c
    #if (G8_12PL != 0)
    FSIRXH_INT2_ISR,                            // 8.12 - FSIH Receive interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_13PL != 0)
    INT_NOTUSED_ISR,                            // 8.13 - CLB5 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_14PL != 0)
    INT_NOTUSED_ISR,                            // 8.14 - CLB6 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

#ifdef CPU1

    #if (G8_15PL != 0)
    INT_NOTUSED_ISR,                            // 8.15 - CLB7 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_16PL != 0)
    INT_NOTUSED_ISR,                            // 8.16 - CLB8 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif
#elif defined(CPU2)
    #if (G8_15PL != 0)
    INT_NOTUSED_ISR,                            // 8.15 - CLB7 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G8_16PL != 0)
    INT_NOTUSED_ISR,                            // 8.16 - CLB8 Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif
#endif

    #if (G9_9PL != 0)
    MCANSS_INT0_ISR,                            // 9.9 - MCAN Sub-System Interrupt 0
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G9_10PL != 0)
    MCANSS_INT1_ISR,                            // 9.10 - MCAN Sub-System Interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G9_11PL != 0)
    MCANSS_ECC_CORR_LVL_INT_ISR,                // 9.11 - MCAN Sub-System ECC error Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G9_12PL != 0)
    MCANSS_WAKE_AND_TS_PLS_INT_ISR,             // 9.12 - MCAN Sub-System wakeup Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G9_13PL != 0)
    PMBUSA_ISR,                                 // 9.13 - PMBUSA Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G9_14PL != 0)
    CM_STATUS_INT_ISR,                          // 9.14 - CM Reset Status Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif
#ifdef CPU1

    #if (G9_15PL != 0)
    USBA_ISR,                     // 9.15 - USBA Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif
#elif defined(CPU2)
    PIE_RESERVED_ISR,             // 9.15 - Reserved
#endif
    PIE_RESERVED_ISR,             // 9.16 - Reserved

    #if (G10_9PL != 0)
    ADCC_EVT_ISR,                 // 10.9 - ADCC Event Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_10PL != 0)
    ADCC2_ISR,                    // 10.10 - ADCC Interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_11PL != 0)
    ADCC3_ISR,                    // 10.11 - ADCC Interrupt 3
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_12PL != 0)
    ADCC4_ISR,                    // 10.12 - ADCC Interrupt 4
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_13PL != 0)
    ADCD_EVT_ISR,                 // 10.13 - ADCD Event Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_14PL != 0)
    ADCD2_ISR,                    // 10.14 - ADCD Interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_15PL != 0)
    ADCD3_ISR,                    // 10.15 - ADCD Interrupt 3
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G10_16PL != 0)
    ADCD4_ISR,                    // 10.16 - ADCD Interrupt 4
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_9PL != 0)
    CMTOCPUIPCINTR1_ISR,                        // 11.16 - CM to CPU IPC Interrupt 8
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_10PL != 0)
    CMTOCPUIPCINTR2_ISR,                        // 11.9 - CM to CPU IPC Interrupt 1
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_11PL != 0)
    CMTOCPUIPCINTR3_ISR,                        // 11.10 - CM to CPU IPC Interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_12PL != 0)
    CMTOCPUIPCINTR4_ISR,                        // 11.11 - CM to CPU IPC Interrupt 3
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_13PL != 0)
    CMTOCPUIPCINTR5_ISR,                        // 11.12 - CM to CPU IPC Interrupt 4
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_14PL != 0)
    CMTOCPUIPCINTR6_ISR,                        // 11.13 - CM to CPU IPC Interrupt 5
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_15PL != 0)
    CMTOCPUIPCINTR7_ISR,                        // 11.15 - CM to CPU IPC Interrupt 7
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G11_16PL != 0)
    CMTOCPUIPCINTR8_ISR,                        // 11.16 - CM to CPU IPC Interrupt 8
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_9PL != 0)
    PIE_RESERVED_ISR,               // 12.9 - EMIF Error Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_10PL != 0)
    ECAP6INT2_ISR,                              // 12.10 - eCAP6 Interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_11PL != 0)
    ECAP7INT2_ISR,                              // 12.11 - eCAP7 Interrupt 2
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_12PL != 0)
    PIE_RESERVED_ISR,     // 12.12 - RAM Access Violation Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_13PL != 0)
    CPUCRC_INT_ISR,                             // 12.13 - CPU BGCRC module interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_14PL != 0)
    CLA1CRC_INT_ISR,                            // 12.14 - CLA1 BGCRC module interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_15PL != 0)
    CLA_OVERFLOW_ISR,             // 12.15 - CLA Overflow Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

    #if (G12_16PL != 0)
    CLA_UNDERFLOW_ISR             // 12.16 - CLA Underflow Interrupt
    #else
    INT_NOTUSED_ISR,
    #endif

};

//
// InitPieVectTable - This function initializes the PIE vector table to a known
// state. This function must be executed after boot time.
//
void
InitPieVectTable(void)
{
    int16 i;
    Uint32 *Source = (void *) &PieVectTableInit;
    Uint32 *Dest = (void *) &PieVectTable;

    //
    // Do not write over first 3 32-bit locations (these locations are
    // initialized by Boot ROM with boot variables)
    //
    Source = Source + 3;
    Dest = Dest + 3;

    EALLOW;
    for(i=0; i < 221; i++)
    {
        *Dest++ = *Source++;
    }
    EDIS;
}

//
// End of File
//
